# Licensed Materials - Property of IBM
# IBM Sterling Selling and Fulfillment Suite
# (C) Copyright IBM Corp. 2001, 2013 All Rights Reserved.
# US Government Users Restricted Rights - Use, duplication or disclosure restricted by GSA ADP Schedule Contract with IBM Corp.

# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE


security_exception_while_instantiating_mashup_class=Se ha producido una excepci\u00f3n de seguridad al crear una instancia de una clase de mashup.
classnotfound_exception_while_instantiating_mashup_class=Se ha producido una excepci\u00f3n de clase no encontrada al crear una instancia de una clase de mashup.
instantiation_exception_while_instantiating_mashup_class=Se ha producido una excepci\u00f3n de instanciaci\u00f3n al instanciar una clase de mashup.
illegalaccess_exception_while_instantiating_mashup_class=Se ha producido una excepci\u00f3n de acceso no permitido al crear una instancia de una clase de mashup.
classcast_exception_while_instantiating_mashup_class=Se ha producido una excepci\u00f3n de conversi\u00f3n de clase al crear una instancia de una clase de mashup.
mashup_meta_data_not_found=No se han encontrado los metadatos de mashup.
mashup_extension_file_not_found=No se ha encontrado el archivo de extensi\u00f3n de mashup.
mashup_extension_file_wrong_format=El archivo de extensi\u00f3n de mashup no tiene un formato v\u00e1lido.
mashup_file_not_found=Archivo de mashup no encontrado.
mashup_file_wrong_format=El archivo de mashup no tiene un formato v\u00e1lido.
not_able_to_derive_datatype_from_the_attributeName=No se puede derivar un tipo de datos de attributeName.
parsing_of_entire_string_to_number_failed=El an\u00e1lisis de toda la serie hasta el n\u00famero ha fallado.
value_should_not_be_negative_for_datatype=El valor no debe ser negativo para el tipo de datos.
value_should_not_contain_zero=El valor no debe contener cero.
number_of_fraction_digits_exceeded=Se ha superado el n\u00famero de d\u00edgitos de fracci\u00f3n.
number_not_within_the_maximum_and_minimum_bounds=El n\u00famero no est\u00e1 dentro de los l\u00edmites m\u00e1ximo y m\u00ednimo.
entire_string_could_not_be_parsed_into_date=No se ha podido analizar toda la serie en la fecha.
unable_to_parse_time_from_text=No se puede analizar la hora del texto.
length_of_value_has_exceeded_the_length_allowed_by_datatype=La longitud del valor ha superado la longitud permitida por el tipo de datos.
error_input_required=La entrada es necesaria.
error_input_length_lesser_than_expected=La longitud de la entrada debe ser de m\u00e1s de {0}
error_input_length_exceeded_maximum_limit=La entrada no debe superar m\u00e1s de {0} caracteres.
error_input_does_not_conform_pattern=La entrada debe adaptarse a la expresi\u00f3n regular {0}.
error_input_matches_not_allowed_pattern=La entrada no debe coincidir con la expresi\u00f3n regular {0}.

