# Licensed Materials - Property of IBM
# IBM Sterling Selling and Fulfillment Suite
# (C) Copyright IBM Corp. 2001, 2013 All Rights Reserved.
# US Government Users Restricted Rights - Use, duplication or disclosure restricted by GSA ADP Schedule Contract with IBM Corp.

# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE


security_exception_while_instantiating_mashup_class=Une exception de s\u00e9curit\u00e9 s'est produite pendant l'instanciation de la classe composite.
classnotfound_exception_while_instantiating_mashup_class=Une exception de classe introuvable s'est produite pendant l'instanciation de la classe composite.
instantiation_exception_while_instantiating_mashup_class= Une exception d'instanciation s'est produite pendant l'instanciation de la classe composite.
illegalaccess_exception_while_instantiating_mashup_class= Une exception d'acc\u00e8s ill\u00e9gal s'est produite pendant l'instanciation de la classe composite.
classcast_exception_while_instantiating_mashup_class= Une exception de transtypage de classe s'est produite pendant l'instanciation de la classe composite.
mashup_meta_data_not_found=M\u00e9tadonn\u00e9es d'application composite introuvables.
mashup_extension_file_not_found=Fichier d'extension d'application composite introuvable.
mashup_extension_file_wrong_format=Le fichier d'extension d'application composite n'est pas \u00e0 un format valide.
mashup_file_not_found=Fichier d'application composite introuvable.
mashup_file_wrong_format=Le fichier d'application composite n'est pas \u00e0 un format valide.
not_able_to_derive_datatype_from_the_attributeName= Impossible de d\u00e9river le type de donn\u00e9es \u00e0 partir du nom d'attribut.
parsing_of_entire_string_to_number_failed=\u00c9chec de l'analyse syntaxique de la cha\u00eene enti\u00e8re sur le nombre.
value_should_not_be_negative_for_datatype=La valeur ne doit pas \u00eatre n\u00e9gative pour le type de donn\u00e9es.
value_should_not_contain_zero=La valeur ne doit pas contenir z\u00e9ro.
number_of_fraction_digits_exceeded=Nombre de chiffres de fraction d\u00e9pass\u00e9.
number_not_within_the_maximum_and_minimum_bounds=Le nombre n'est pas inclus entre les limites maximales et minimales.
entire_string_could_not_be_parsed_into_date= La cha\u00eene enti\u00e8re n'a pas pu \u00eatre convertie en date
unable_to_parse_time_from_text=Impossible d'analyser la dur\u00e9e \u00e0 partir du texte.
length_of_value_has_exceeded_the_length_allowed_by_datatype= la longueur de la valeur a d\u00e9pass\u00e9 la longueur autoris\u00e9e par datatype.
error_input_required=L'entr\u00e9e est obligatoire.
error_input_length_lesser_than_expected=La longueur de l''entr\u00e9e doit \u00eatre sup\u00e9rieure \u00e0 {0}.
error_input_length_exceeded_maximum_limit= L''entr\u00e9e ne doit pas d\u00e9passer plus de {0} caract\u00e8res.
error_input_does_not_conform_pattern= L''entr\u00e9e doit \u00eatre conforme \u00e0 l''expression r\u00e9guli\u00e8re {0}.
error_input_matches_not_allowed_pattern= L''entr\u00e9e ne doit pas correspondre \u00e0 l''expression r\u00e9guli\u00e8re {0}.

