# Licensed Materials - Property of IBM
# IBM Sterling Selling and Fulfillment Suite
# (C) Copyright IBM Corp. 2001, 2013 All Rights Reserved.
# US Government Users Restricted Rights - Use, duplication or disclosure restricted by GSA ADP Schedule Contract with IBM Corp.

# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE


security_exception_while_instantiating_mashup_class=A exce\u00e7\u00e3o de seguran\u00e7a ocorreu durante o instanciamento da classe de mashup.
classnotfound_exception_while_instantiating_mashup_class=A classe n\u00e3o encontrou a exce\u00e7\u00e3o ocorrida durante o instanciamento da classe de mashup.
instantiation_exception_while_instantiating_mashup_class=A exce\u00e7\u00e3o de instancia\u00e7\u00e3o ocorreu durante a instancia\u00e7\u00e3o da classe de mashup.
illegalaccess_exception_while_instantiating_mashup_class=O acesso ilegal \u00e0 exce\u00e7\u00e3o ocorreu durante o instanciamento da classe de mashup.
classcast_exception_while_instantiating_mashup_class=A exce\u00e7\u00e3o ClassCastException ocorreu durante o instanciamento da classe de mashup.
mashup_meta_data_not_found=Os dados meta de mashup n\u00e3o foram encontrados.
mashup_extension_file_not_found=O arquivo de extens\u00e3o de mashup n\u00e3o foi encontrado.
mashup_extension_file_wrong_format=O arquivo de extens\u00e3o de mashup n\u00e3o \u00e9 um formato v\u00e1lido.
mashup_file_not_found=O arquivo de mashup n\u00e3o foi encontrado.
mashup_file_wrong_format=O arquivo de mashup n\u00e3o \u00e9 um formato v\u00e1lido.
not_able_to_derive_datatype_from_the_attributeName=N\u00e3o \u00e9 poss\u00edvel derivar o tipo e dados do attributeName.
parsing_of_entire_string_to_number_failed=A an\u00e1lise sint\u00e1tica da sequ\u00eancia completa para o n\u00famero falhou.
value_should_not_be_negative_for_datatype=O valor n\u00e3o deve ser negativo para o tipo de dados.
value_should_not_contain_zero=O valor n\u00e3o deve conter zero.
number_of_fraction_digits_exceeded=O n\u00famero de d\u00edgitos fracion\u00e1rios foi excedido.
number_not_within_the_maximum_and_minimum_bounds=N\u00famero fora dos limites m\u00e1ximo e m\u00ednimo.
entire_string_could_not_be_parsed_into_date=A sequ\u00eancia completa n\u00e3o deve ser analisada por data.
unable_to_parse_time_from_text=N\u00e3o \u00e9 poss\u00edvel analisar o hor\u00e1rio do texto.
length_of_value_has_exceeded_the_length_allowed_by_datatype=O comprimento do valor excedeu o comprimento permitido pelo tipo de dados.
error_input_required=A entrada \u00e9 necess\u00e1ria.
error_input_length_lesser_than_expected=O comprimento de entrada deve ser maior que {0}.
error_input_length_exceeded_maximum_limit=A entrada n\u00e3o deve exceder mais que {0} caracteres.
error_input_does_not_conform_pattern=A entrada deve estar em conformidade com a express\u00e3o regular {0}.
error_input_matches_not_allowed_pattern=A entrada n\u00e3o deve corresponder \u00e0s express\u00e3o regular {0}.

